guix.org
#+TITLE: GNU Guix on Xubuntu, literate and sovereign
#+AUTHOR: Mètsàtron
#+LANGUAGE: en
#+PROPERTY: header-args :mkdirp yes :results silent :comments both

* Intent
A minimal, sovereign Guix install on a Debian-family host, managed from this repo.
We keep privileged steps explicit, package state declarative, and paths inside overlays.
Nothing in here overwrites your shell files directly, it only adds small blocks that tangle into your existing exports files.

* Layout
- Guix channels, profiles, manifests under =all/.config/guix/=
- Helper scripts under =all/.local/bin/=
- Shell exports for PATH added in tiny, self-contained blocks that tangle into =all/.bash_exports= and =all/.zsh_exports=
- No files removed, only appended sections with clear sentinels

* One-time system bootstrap
Only run once on this machine. This mirrors the upstream manual for a foreign distro install.

#+BEGIN_SRC bash :tangle no
# 0) Prereqs
sudo apt update
sudo apt install -y build-essential git curl xz-utils bzip2

# 1) Download official installer, verify, run
cd /tmp
rm -f guix-install.sh guix-install.sh.sig

# Follow redirects and fail if not 200
curl -fL -o guix-install.sh 'https://git.savannah.gnu.org/cgit/guix.git/plain/etc/guix-install.sh'
# Quick sanity check
head -n 3 guix-install.sh
# Expect to see: #!/bin/sh on the first line
chmod +x guix-install.sh
# Optional: verify PGP signature if you added Guix keys
# Run the installer
sudo ./guix-install.sh

# 2) Authorize substitute servers, improves build time
# ci.guix.gnu.org should be present after installer, we add bordeaux as well if available
if [ -r /usr/share/guix/bordeaux.guix.gnu.org.pub ]; then
  sudo guix archive --authorize < /usr/share/guix/bordeaux.guix.gnu.org.pub
fi

# 3) Enable and start the daemon
sudo systemctl enable --now guix-daemon
systemctl status guix-daemon --no-pager
#+END_SRC

If the installer complains about guixbuild users, re-run it or create them with =addgroup guixbuild= and =adduser --system= 10 workers linked to that group, which the installer usually handles.

* Channels, manifests, profiles
** Channel pin, reproducible by time-machine if desired
Tangling target: =all/.config/guix/channels.scm=

#+BEGIN_SRC scheme :tangle all/.config/guix/channels.scm
;; Guix channels for Mètsàtron
(list
  (channel
    (name 'guix)
    (url "https://git.savannah.gnu.org/git/guix.git")
    ;; Optional pin to a commit for stable rollouts. Uncomment to lock.
    ;; (commit "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa")
    )
  ;; Example community channel, disabled by default
  ;; (channel
  ;;   (name 'nonguix)
  ;;   (url "https://gitlab.com/nonguix/nonguix.git"))
)
#+END_SRC

** User profile manifests
Tangling target: =all/.config/guix/manifests/dev.scm= and friends.

#+BEGIN_SRC scheme :tangle all/.config/guix/manifests/core.scm
;; Core userland that is safe on a foreign distro
(specifications->manifest
 '(
   "git"
   "htop"
   "ripgrep"
   "fd"
   "jq"
   "direnv"
   "btop"
   "python"
   "node"   ;; small Node for tooling, adjust if you prefer system Node
   ))
#+END_SRC

#+BEGIN_SRC scheme :tangle all/.config/guix/manifests/dev.scm
(specifications->manifest
 '(
   "gcc-toolchain"
   "gdb"
   "cmake"
   "pkg-config"
   "meson"
   "ninja"
   "shellcheck"
   "shfmt"
   "bear"
   ))
#+END_SRC

Add more manifests as needed, for example =audio.scm= or =media.scm=. Keep them small and purposeful.

** Profile directories
We keep explicit profile prefixes under =~/.guix-extra-profiles= so nothing bleeds into your main profile unless you choose so.

Tangling target: none, just convention used by scripts below:
- =~/.guix-extra-profiles/core=
- =~/.guix-extra-profiles/dev=

* Helper scripts
Tangling target: =all/.local/bin/guix-profile-apply=, =guix-profile-list=, =guix-gc-safe=, =guix-search=

#+BEGIN_SRC bash :tangle all/.local/bin/guix-profile-apply :shebang "#!/usr/bin/env bash"
set -euo pipefail
# Apply a manifest to a named profile under ~/.guix-extra-profiles/<name>
name="${1:-}"
manifest="${2:-}"
if [ -z "$name" ] || [ -z "$manifest" ]; then
  echo "Usage: $(basename "$0") <profile-name> <manifest.scm>" >&2
  exit 1
fi
base="$HOME/.guix-extra-profiles/$name"
mkdir -p "$base"
guix package -m "$manifest" -p "$base/$name"
echo "Profile updated: $base/$name"
echo "To activate in this shell:"
echo "  GUIX_PROFILE=$base/$name; . \"$GUIX_PROFILE/etc/profile\""
#+END_SRC

#+BEGIN_SRC bash :tangle all/.local/bin/guix-profile-list :shebang "#!/usr/bin/env bash"
set -euo pipefail
find "$HOME/.guix-extra-profiles" -maxdepth 2 -type d -name "*-link" 2>/dev/null | sort || true
echo
echo "User generations:"
guix package --list-generations || true
#+END_SRC

#+BEGIN_SRC bash :tangle all/.local/bin/guix-gc-safe :shebang "#!/usr/bin/env bash"
set -euo pipefail
echo "Showing store disk usage:"
guix gc --list-live
echo
echo "Running garbage collection for unused items..."
guix gc
echo "Done."
#+END_SRC

#+BEGIN_SRC bash :tangle all/.local/bin/guix-search :shebang "#!/usr/bin/env bash"
set -euo pipefail
if [ $# -eq 0 ]; then
  echo "Usage: $(basename "$0") <query...>" >&2
  exit 1
fi
guix search "$@"
#+END_SRC

* Daily use, cheat-sheet
- Update channels then upgrade user profiles
  #+BEGIN_SRC bash :tangle no
  guix pull
  make guix-core guix-dev
  # Activate a profile in your current shell if you want its tools
  export GUIX_PROFILE="$HOME/.guix-extra-profiles/core/core"
  . "$GUIX_PROFILE/etc/profile"
  #+END_SRC
- Search packages
  #+BEGIN_SRC bash :tangle no
  guix-search neovim
  #+END_SRC
- Roll back a profile
  #+BEGIN_SRC bash :tangle no
  guix package -p "$HOME/.guix-extra-profiles/core/core" --roll-back
  #+END_SRC
- List user generations and extra profiles
  #+BEGIN_SRC bash :tangle no
  guix-profile-list
  #+END_SRC
- Collect garbage safely
  #+BEGIN_SRC bash :tangle no
  guix-gc-safe
  #+END_SRC

* Notes
- Guix Home is intentionally not enabled here, since you use literate dotfiles as the source of truth. We keep Guix focused on packages and profiles.
- If you ever add =nonguix=, you must explicitly authorize its substitute key. Keep that ritual documented alongside the channels pin.
- Guix can install many tools that overlap with apt, snaps, or flatpaks. Prefer one source per tool to reduce path ambiguity.
