all/.local/bin/guix-profile-apply
#!/usr/bin/env bash
# Helper scripts
# Tangling target: =all/.local/bin/guix-profile-apply=, =guix-profile-list=, =guix-gc-safe=, =guix-search=


# [[file:../../../guix.org::*Helper scripts][Helper scripts:1]]
set -euo pipefail
# Apply a manifest to a named profile under ~/.guix-extra-profiles/<name>
name="${1:-}"
manifest="${2:-}"
if [ -z "$name" ] || [ -z "$manifest" ]; then
  echo "Usage: $(basename "$0") <profile-name> <manifest.scm>" >&2
  exit 1
fi
base="$HOME/.guix-extra-profiles/$name"
mkdir -p "$base"
guix package -m "$manifest" -p "$base/$name"
echo "Profile updated: $base/$name"
echo "To activate in this shell:"
echo "  GUIX_PROFILE=$base/$name; . \"$GUIX_PROFILE/etc/profile\""
# Helper scripts:1 ends here
